tutorial/hardwood/poplar(Zhang2016)/5K/RACHC/0/weightedK_
300 8.91822e-06
300 8.91705e-06
300.025 8.9266e-06
300.05 8.93616e-06
300.075 8.94651e-06
300.083 8.94891e-06
300.108 8.95848e-06
300.133 8.96807e-06
300.158 8.97844e-06
300.167 8.98085e-06
300.192 8.99045e-06
300.217 9.00005e-06
300.242 9.01046e-06
300.25 9.01287e-06
300.275 9.02249e-06
300.3 9.03212e-06
300.325 9.04255e-06
300.333 9.04496e-06
300.358 9.05461e-06
300.383 9.06426e-06
300.408 9.07472e-06
300.417 9.07714e-06
300.442 9.08681e-06
300.467 9.09648e-06
300.492 9.10698e-06
300.5 9.10939e-06
300.525 9.11908e-06
300.55 9.12878e-06
300.575 9.13931e-06
300.583 9.14172e-06
300.608 9.15144e-06
300.633 9.16116e-06
300.658 9.17172e-06
300.667 9.17413e-06
300.692 9.18387e-06
300.717 9.19362e-06
300.742 9.2042e-06
300.75 9.20662e-06
300.775 9.21638e-06
300.8 9.22615e-06
300.825 9.23677e-06
300.833 9.23919e-06
300.858 9.24898e-06
300.883 9.25877e-06
300.908 9.26941e-06
300.917 9.27184e-06
300.942 9.28165e-06
300.967 9.29146e-06
300.992 9.30214e-06
301 9.30456e-06
301.025 9.31439e-06
301.05 9.32423e-06
301.075 9.33494e-06
301.083 9.33736e-06
301.108 9.34722e-06
301.133 9.35709e-06
301.158 9.36782e-06
301.167 9.37025e-06
301.192 9.38013e-06
301.217 9.39001e-06
301.242 9.40078e-06
301.25 9.40321e-06
301.275 9.41311e-06
301.3 9.42302e-06
301.325 9.43382e-06
301.333 9.43625e-06
301.358 9.44617e-06
301.383 9.45611e-06
301.408 9.46693e-06
301.417 9.46936e-06
301.442 9.47932e-06
301.467 9.48927e-06
301.492 9.50013e-06
301.5 9.50256e-06
301.525 9.51254e-06
301.55 9.52252e-06
301.575 9.5334e-06
301.583 9.53584e-06
301.608 9.54583e-06
301.633 9.55584e-06
301.658 9.56675e-06
301.667 9.56919e-06
301.692 9.57921e-06
301.717 9.58924e-06
301.742 9.60018e-06
301.75 9.60262e-06
301.775 9.61266e-06
301.8 9.62272e-06
301.825 9.63369e-06
301.833 9.63613e-06
301.858 9.6462e-06
301.883 9.65627e-06
301.908 9.66728e-06
301.917 9.66972e-06
301.942 9.67981e-06
301.967 9.68991e-06
301.992 9.70094e-06
302 9.70338e-06
302.025 9.7135e-06
302.05 9.72362e-06
...
1273 6.07969e-32
